// pages/ls/ls.js
Page({

    /**
     * 页面的初始数据
     */
    data: {
        ls:[{title:'上海党的一大会址',img:'/pages/img/sh.jpeg',xx:'1921年7月23日晚，中国共产党第一次全国代表大会在上海法租界望志路106号（今兴业路76号）开幕。从7月23日到30日，党的一大一共开了6次会议。7月30日晚上的第六次会议原定通过各项文件并进行选举，但在上海继续开会出现了安全问题。经研究，代表们转移到浙江嘉兴南湖，在一艘租用的游船上召开了最后一天的会议，讨论通过了中国共产党第一个纲领和中国共产党第一个决议。'},
        {title:'中华人民共和国的成立',img:'/pages/img/beijin.jpeg',xx:'1949年9月，中国人民政治协商会议第一届全体会议在北平隆重举行。会议圆满完成了创建中华人民共和国的光荣使命。10月1日，30万军民齐集天安门广场，举行开国大典。'},
        {title:'上海党的一大会址',img:'/pages/img/sh.jpeg',xx:'1921年7月23日晚，中国共产党第一次全国代表大会在上海法租界望志路106号（今兴业路76号）开幕。从7月23日到30日，党的一大一共开了6次会议。7月30日晚上的第六次会议原定通过各项文件并进行选举，但在上海继续开会出现了安全问题。经研究，代表们转移到浙江嘉兴南湖，在一艘租用的游船上召开了最后一天的会议，讨论通过了中国共产党第一个纲领和中国共产党第一个决议。'}
    
    ]
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad(options) {

    },

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady() {

    },

    /**
     * 生命周期函数--监听页面显示
     */
    onShow() {

    },

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide() {

    },

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload() {

    },

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh() {

    },

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom() {

    },

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage() {

    }
})